package jp.couplink.app.utils

/**
 * Created by BinhTran on 12/7/2017.
 */

class TitleJSONConstant {
    companion object {
        val TITLE_LAST_LOGIN_TYPE = "{ \"last_login_types\": [\n" +
                "      {\n" +
                "        \"value\": 1,\n" +
                "        \"name\": \"オンライン\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"value\": 2,\n" +
                "        \"name\": \"24時間以内\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"value\": 3,\n" +
                "        \"name\": \"3日以内\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"value\": 4,\n" +
                "        \"name\": \"1週間以内\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"value\": 5,\n" +
                "        \"name\": \"2週間以内\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"value\": 6,\n" +
                "        \"name\": \"1ヶ月以内\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_DRINKING_TYPE = " {\"drinking_types\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"未設定\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"飲む\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"飲まない\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"ときどき飲む\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_SMOKING_TYPE = " {\"smoking_types\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"未設定\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"吸う\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"非喫煙者がいるときは吸わない\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"相手が嫌ならやめる\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 5,\n" +
                "        \"name\": \"吸わない\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_HOLIDAY_TYPE = " {\"holiday_types\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"土日\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"平日\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"不定期\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"その他\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_BODY_SHAPE = "{\"body_shape_types\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"未設定\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"スリム\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"やや細め\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"普通\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 5,\n" +
                "        \"name\": \"グラマー\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 6,\n" +
                "        \"name\": \"筋肉質\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 7,\n" +
                "        \"name\": \"ややぽっちゃり\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 8,\n" +
                "        \"name\": \"太め\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_JOBS = "{ \"jobs\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"未設定\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"上場企業\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"金融\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"公務員\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 5,\n" +
                "        \"name\": \"コンサル\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 6,\n" +
                "        \"name\": \"経営者・役員\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 7,\n" +
                "        \"name\": \"大手企業\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 8,\n" +
                "        \"name\": \"大手外資\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 9,\n" +
                "        \"name\": \"大手商社\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 10,\n" +
                "        \"name\": \"外資金融\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 11,\n" +
                "        \"name\": \"医師\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 12,\n" +
                "        \"name\": \"弁護士\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 13,\n" +
                "        \"name\": \"公認会計士\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 14,\n" +
                "        \"name\": \"パイロット\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 15,\n" +
                "        \"name\": \"広告\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 16,\n" +
                "        \"name\": \"マスコミ\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 17,\n" +
                "        \"name\": \"教育関連\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 18,\n" +
                "        \"name\": \"IT関連\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 19,\n" +
                "        \"name\": \"食品関連\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 20,\n" +
                "        \"name\": \"製薬\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 21,\n" +
                "        \"name\": \"保険\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 22,\n" +
                "        \"name\": \"不動産\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 23,\n" +
                "        \"name\": \"建築関連\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 24,\n" +
                "        \"name\": \"通信\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 25,\n" +
                "        \"name\": \"WEB業界\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 26,\n" +
                "        \"name\": \"クリエイター\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 27,\n" +
                "        \"name\": \"接客業\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 28,\n" +
                "        \"name\": \"調理師・栄養士\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 29,\n" +
                "        \"name\": \"アパレル・ショップ\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 30,\n" +
                "        \"name\": \"エンターテイメント\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 31,\n" +
                "        \"name\": \"アナウンサー\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 32,\n" +
                "        \"name\": \"芸能・モデル\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 33,\n" +
                "        \"name\": \"事務員\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 34,\n" +
                "        \"name\": \"福祉・介護\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 35,\n" +
                "        \"name\": \"保育士\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 36,\n" +
                "        \"name\": \"会社員\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 37,\n" +
                "        \"name\": \"学生\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 38,\n" +
                "        \"name\": \"自由業\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 39,\n" +
                "        \"name\": \"ブライダル\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 40,\n" +
                "        \"name\": \"その他\"\n" +
                "      }\n" +
                "    ]}"
        val TITLE_PREFECTURE = "{\"prefectures\": [\n" +
                "      {\n" +
                "        \"id\": 1,\n" +
                "        \"name\": \"北海道\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 2,\n" +
                "        \"name\": \"青森県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 3,\n" +
                "        \"name\": \"岩手県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 4,\n" +
                "        \"name\": \"宮城県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 5,\n" +
                "        \"name\": \"秋田県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 6,\n" +
                "        \"name\": \"山形県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 7,\n" +
                "        \"name\": \"福島県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 8,\n" +
                "        \"name\": \"茨城県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 9,\n" +
                "        \"name\": \"栃木県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 10,\n" +
                "        \"name\": \"群馬県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 11,\n" +
                "        \"name\": \"埼玉県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 12,\n" +
                "        \"name\": \"千葉県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 13,\n" +
                "        \"name\": \"東京都\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 14,\n" +
                "        \"name\": \"神奈川県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 15,\n" +
                "        \"name\": \"新潟県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 16,\n" +
                "        \"name\": \"富山県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 17,\n" +
                "        \"name\": \"石川県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 18,\n" +
                "        \"name\": \"福井県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 19,\n" +
                "        \"name\": \"山梨県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 20,\n" +
                "        \"name\": \"長野県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 21,\n" +
                "        \"name\": \"岐阜県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 22,\n" +
                "        \"name\": \"静岡県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 23,\n" +
                "        \"name\": \"愛知県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 24,\n" +
                "        \"name\": \"三重県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 25,\n" +
                "        \"name\": \"滋賀県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 26,\n" +
                "        \"name\": \"京都府\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 27,\n" +
                "        \"name\": \"大阪府\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 28,\n" +
                "        \"name\": \"兵庫県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 29,\n" +
                "        \"name\": \"奈良県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 30,\n" +
                "        \"name\": \"和歌山県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 31,\n" +
                "        \"name\": \"鳥取県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 32,\n" +
                "        \"name\": \"島根県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 33,\n" +
                "        \"name\": \"岡山県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 34,\n" +
                "        \"name\": \"広島県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 35,\n" +
                "        \"name\": \"山口県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 36,\n" +
                "        \"name\": \"徳島県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 37,\n" +
                "        \"name\": \"香川県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 38,\n" +
                "        \"name\": \"愛媛県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 39,\n" +
                "        \"name\": \"高知県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 40,\n" +
                "        \"name\": \"福岡県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 41,\n" +
                "        \"name\": \"佐賀県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 42,\n" +
                "        \"name\": \"長崎県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 43,\n" +
                "        \"name\": \"熊本県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 44,\n" +
                "        \"name\": \"大分県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 45,\n" +
                "        \"name\": \"宮崎県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 46,\n" +
                "        \"name\": \"鹿児島県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 47,\n" +
                "        \"name\": \"沖縄県\"\n" +
                "      },\n" +
                "      {\n" +
                "        \"id\": 48,\n" +
                "        \"name\": \"未設定\"\n" +
                "      }\n" +
                "    ]}"


    }

}

